Repository: WPPlugins/embed-bbpress
Catalog: translation/embed-bbpress-*.po
Languages: he_il

source: Options saved.
he_il: האפשרויות נשמרו.

source: embed BBpress 0.8
he_il: embed BBpress - גרסה 0.8

source: technically, this plugin was built for embeding the external home page of BBpress, after the installation, in the easiest way i could think of. However, because the method is so simple, one can use it for embeding any HTML page he wants.
he_il: טכנית, התוסף הזה נבנה על מנת להטמיע את הדף הבית החיצוני של הפורום BBpress, לאחר ההתקנה, כמובן, בצורה הכי פשוטה שיכולתי לחשוב עליה. עם זאת, מכיוון שהשיטה הזו כל-כך פשוטה, ניתן להטמיע בה כל אובייקט html אחר.

source: note: the purpose was the ease of use, and not elegancy. we could made it more complicated by trying to force the forum to have the site template or something like this. but we didn't.
he_il: הערה: מטרת התוסף הייתה שימוש פשוט למשתמש, לא אלגנטיות. יכולנו לעשות משהו מסובך ולנסות לכפות על הפורום את התבנית של האתר או משהו כזה. אבל לא עשינו זאת.

source: for suggestions about further development
he_il: להצעות לגבי פיתוח עתידי

source: mail me
he_il: שלח לי דוא"ל

source: Step-By-Step Setting
he_il: הגדרה בצעדים פשוטים:

source: 1. Install BBpress.
he_il: התקן את BBpress.

source: 2. Load the special embedable template
he_il: טען את קבצי התבנית המעוצבת להטמעה

source: from here
he_il: מכאן

source: and upload the entire folder as it is to 'bb-templates' in the root of the forum directory.
he_il: והעלה את כל התקיה לתוך bb-templates שבספרייה הראשית של הפורום שלך.

source: 3. Activate 'Embed BBpress', copy the forum home URL to the first field and choose the width and height of your desire (without "px's").
he_il: 3. הפעל את 'Embed BBpress', העתק את כתובת דף הבית של הפרום לשדה הראשון ובחר את הרוחב והגובה הרצויים לך (בלי "px", רק מספרים).

source: 4. Create a new page, and paste the shortcode [EmbedBBpress] inside it .
he_il: 4. צור דף חדש, והדבק את הקוד [EmbedBBpress] בתוכו, במקום הרצוי.

source: 5. You're good to go.
he_il: 5. סע לשלום. המפתחות בפנים.

source: Settings
he_il: הגדרות

source: URL of Home page to embed:
he_il: כתובת URL של דף הבית שאנו מעוניים להטמיע:

source: width of frame:
he_il: רוחב חלון ההטמעה:

source: height of frame:
he_il: גובה חלון ההטמעה:

source: save settings
he_il: שמור הגדרות

source: If you want to give something back:
he_il: אם אתה מעוניין לתת משהו חזרה:

source: My Amazon Wishlist
he_il: רשימת הבקשות שלי מאמזון

source: Click here if the forum doesn't open by itself
he_il: לחץ כאן אם הפורום לא נפתח מעצמו
